{
  "core": {
    "pageTitle": "Martin Parker Portfolio",
    "pageTitleExpanded": "Martin Parker Portfolio | {0}"
  },
  "navigation": {
    "pageTitle": "Martin Parker Portfolio",
    "about": "About This Site",
    "portfolio": "Portfolio",
    "cv": "CV",
    "menu": "Menu",
    "menuIconInstructions": "Toggle the navigation menu",
    "menuIconDescription": "Navigation menu toggle icon"
  },
  "about": {
    "title": "About This Site",
    "summary": "This site was built with Angular and .NET Core. It acts as a living showcase of my ability. Expand for a deep dive into the digiverse...",
    "detailOne": "To be written on completion of the final site archetecture.",
    "showMore": "show more",
    "showLess": "show less",
    "hide": "hide"
  },
  "portfolio": {
    "title": "Portfolio",
    "tabTitleHelp": "Help",
    "tabTitleClarification": "Clarification",
    "tabTitleViews": "Views",
    "tabTitleFilter": "Filter",
    "tabTitleSearch": "Search",
    "gameDevelopmentTitle": "Game Development",
    "gameDevelopmentDescription": "Game Development was an open ended module with the aim of developing a game demo.<br>I was placed into a team of 11 with 7 artists and 4 programmers.<br>The only restriction for the game was that it needed to have soundscapes as the main theme and use the sound library the module leaders provided.<br>The finished game was a stealth game with platforming elements.<br>The game was built in Unreal Engine 4.10 and acted as my introduction to building games in an engine instead of from scratch.",
    "gameDevelopmentSearchCriteria": "game development devlopment devlpment devlpmnt dvlpmnt",
    "programming1Title": "Programming 1",
    "programming1Description": "Programming 1 acted as my introduction to programming.<br>The module covered basics from variables and loops up to classes.<br>The first projects were built in notepad and later projects were built in Visual Studio 2010.",
    "programming1SearchCriteria": "programming 1 programming one prog 1 prog one prg programing",
    "programming2Title": "Programming 2",
    "programming2Description": "Programming 2 was a continuation of learning C#.<br>The module covered abstract data types, polymorphism and finally XNA.<br>I have linked the XNA solution for this site.<br>To run the solution you will need both visual studio 2010 and XNA",
    "programming2SearchCriteria": "programming 2 programming two prog 2 prog two prg programing",
    "hangmanTitle": "Hangman",
    "hangmanDescription": "During the christmas break of university there was a challenge to create a hangman game within XNA. <br>This was completely optional and done as a joke by Tommy the lecturer. <br>I completed this over a few weeks in December and made all of the graphics myself.",
    "hangmanSearchCriteria": "hangman hngman hngmn hnmn hmn",
    "databasesTitle": "Databases",
    "databasesDescription": "The databases module in my university course covered the basics of database design and SQL.<br>To my memory this was written in MySQL but I have spent the subsequent year working with SQL Server.<br>I have attached the final assessment for this module.",
    "databasesSearchCriteria": "databases mysql",
    "graphics1Title": "Graphics 1",
    "graphics1Description": "Graphics 1 was an introduction to graphics programming with C++ and OpenGL.<br>The module was split into two assignments. <br>The first assignment was a 2D GUI. The GUI works as a window opening/resizing programme. I have made some changes to the project so it can be run out of the box but only the release build can load the image files.<br>The second assignment is a 3D model viewer. The model viewer is a simple viewer which has rotation control.",
    "graphics1SearchCriteria": "graphics 1 i grphics grphcs graphcs",
    "networksAndSecurityTitle": "Networks And Security",
    "networksAndSecurityDescription": "The networks and security module consisted of mostly theory.<br>The assessment was split into a paper and a python application.<br>The files attached are the python application.",
    "networksAndSecuritySearchCriteria": "networks ntworks netwrks ntwrks and n & nd + security scurity scrity scrty scurty secrity secrty securty",
    "graphics2Title": "Graphics 2",
    "graphics2Description": "Graphics 2 was a continuation of 3D rendering shown in Graphics 1.<br>The rendering used per pixel lighting and code manipulatable shader light sources.<br>I treated this as an exercise of efficiency.<br>The source project has issues with libraries so it does not build. When I have a chance later I will fix this so the solution runs out the box.",
    "graphics2SearchCriteria": "graphics 2 ii grphics grphcs graphcs",
    "applicationDevelopmentTitle": "Application Development",
    "applicationDevelopmentDescription": "Application development was a module based around website development.<br>There were tutorials for both ASP.NET and PHP in the module but I chose to make the application an ASP.NET application.<br>The assessment project uses WebGL on a canvas to render a gallery.<br>The gallery loads custom rooms based off a saved seed.<br>The intention was to add drawing tools to the rooms for customisation.<br>Drawing would change the stored seed for the user to match the drawing.<br>If given the chance I would like to revisit this especially with the new resurgence of virtual reality.",
    "applicationDevelopmentSearchCriteria": "application development applcation devlopment applction devlpment applcton devlpmnt applctn dvlpmnt",
    "teamProjectTitle": "Team Project",
    "teamProjectDescription": "Team project as a module with a loose concept: Build a product within a team.<br>Our team ended up making a tool which encrypts downloads on google chrome browsers.<br>The encryption tool was added to the google play store under the name \"FluffyPuffin\".",
    "teamProjectSearchCriteria": "team project tem tam tm prject projct prjct",
    "systemsProgrammingTitle": "Systems Programming",
    "systemsProgrammingDescription": "Systems Programming was based around building C++ development for systems without user interaction.<br>The assessment was to use the DirectSound API to build a music streaming application which has a 4 second rotary buffer for storing the music.<br>The challenge of this module was wrangling the DirectSound API into working.<br>I would love to revisit this module in the future; changing the api and changing the streaming method from TCP to UDP.",
    "systemsProgrammingSearchCriteria": "systems systms programming prg programing",
    "gameBehaviourTitle": "Game Behaviour",
    "gameBehaviourDescription": "Game Behaviour was a module covering AI and Phsyics in games.<br>For the assesment I made a game in MonoGame which is a non-microsoft continuation of XNA.",
    "gameBehaviourSearchCriteria": "game behaviour",
    "independentStudiesTitle": "Independent Studies",
    "independentStudiesDescription": "Independent Studies is the module name for the dissertation in my BSc.<br>For my dissertation I decided to see if a free-to-play game could use positive actions for currency.<br>The produced game was put on the google play store under the name EnergyRace and has since been removed.",
    "independentStudiesSearchCriteria": "independent studies indi indy std dissertations",
    "applicationDevelopmentImageAltText": "A screen capture of a browser running the Application Development web application.",
    "consoleImageAltText": "A rendering of a computer monitor with a console running.",
    "databaseImageAltText": "A simple graphic representing a database.",
    "gameBehaviourImageAltText": "A screen cap of the game behaviour application with the debug mode turned on. It shows an AI stick person navigating a series of platforms.",
    "gameDevelopmentImageAltText": "A screen cap from the world developed for the Game Development module. It shows corridors of jusk on a mars like planet.",
    "graphics1ImageAltText": "A screen cap of a window running the graphics 1 program. It shows a 2D desktop. On the desktop are layered images of a cat picture and a grassy hill. The pictures have an alpha transparency applied allow visibility of layering.",
    "graphics2ImageAltText": "A screen cap of a window running the graphics 2 program. It shows some 3D models floading above a textured ground model.",
    "hangmanImageAltText": "A graphic from the hangman game. It shows a fully completed hangman on the right. A collection of characters in the top left and the word grid in the bottom left. The background mimics lined school paper.",
    "independentStudiesImageAltText": "A screen cap of a phone running the independent studies game. It shows a menu for purchasing items and behind that a map of existing reseources.",
    "programming2ImageAltText": "A screen cap of the programming 2 application. It shows a city scene with a building on the left of the screen and a crosswalk on the right of the screen.",
    "teamProjectImageAltText": "Instructions for how to use the browser extension created as part of the team project module. The steps are as follows: 1. Click the icon in the top right of the browser with a puffin icon. 2. Click \"Open encryption page\". 3. Click \"Browse files\". 4. Select a file. 5. Enter the Password. 6. Click \"Decrypt\"",
    "tagLanguageTitleTranslation": "Language",
    "tagLanguageValueC++Translation": "C++",
    "tagLanguageValueC#Translation": "C#",
    "tagLanguageValueMySQLTranslation": "MySQL",
    "tagLanguageValueSQLTranslation": "SQL",
    "tagLanguageValuePythonTranslation": "Python",
    "tagLanguageValueJavaScriptTranslation": "JavaScript",
    "tagLanguageValueJavaTranslation": "Java",
    "tagPackageTitleTranslation": "Package",
    "tagPackageValueUnrealEngineTranslation": "Unreal Engine",
    "tagPackageValueXNATranslation": "XNA",
    "tagPackageValueOpenGLTranslation": "OpenGL",
    "tagPackageValueWebGLTranslation": "WebGL",
    "tagPackageValueMonoGameTranslation": "Mono Game",
    "tagUniversityYearTitleTranslation": "University Year",
    "tagUniversityYearValueYear4Translation": "Year 4",
    "tagUniversityYearValueYear1Translation": "Year 1",
    "tagUniversityYearValueYear2Translation": "Year 2",
    "tagProjectStartDateTitleTranslation": "Project Start Date",
    "tagProjectEndDateTitleTranslation": "Project End Date",
    "tagUniversityWorkTitleTranslation": "University Work",
    "download": "Download",
    "moreDetail": "More detail",
    "lessDetail": "Less detail",
    "tagFormat": "{0}: {1}",
    "notBooleanFormat": "Not {0}"
  }
}